In [2]:
import pandas as pd
import numpy as np

In [3]:
df1 = pd.DataFrame({"key": list("bbacaab"),
                    "data1": range(7)})
df2 = pd.DataFrame({"key": list("abd"),
                    "data2": range(3)})

In [5]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [6]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [7]:
pd.merge(df1,df2,on="key")
#on : 어떤열을 기준으로 ?

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [11]:
pd.merge(df1,df2, on="key", how="outer")

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

In [14]:
pd.merge(df1,df2,on="key",how="right")

   data1 key  data2
0    0.0   b      1
1    1.0   b      1
2    6.0   b      1
3    2.0   a      0
4    4.0   a      0
5    5.0   a      0
6    NaN   d      2

In [13]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [16]:
df3 = pd.DataFrame({"lkey": list("bbacaab"),
                    "data1": range(7)})
df4 = pd.DataFrame({"rkey": list("abd"),
                    "data2": range(3)})

In [19]:
df3

   data1 lkey
0      0    b
1      1    b
2      2    a
3      3    c
4      4    a
5      5    a
6      6    b

In [20]:
df4

   data2 rkey
0      0    a
1      1    b
2      2    d

In [21]:
pd.merge(df3,df4,left_on="lkey",right_on="rkey")
#키의 이름이 다를때도 merge기준을 세울 수 있다.

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

In [23]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'], 'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [24]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [25]:
right1

   group_val
a        3.5
b        7.0

In [28]:
pd.merge(left1, right1, left_on="key", right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [30]:
pd.merge(right1,left1,left_index=True,right_on="key")

   group_val key  value
0        3.5   a      0
2        3.5   a      2
3        3.5   a      3
1        7.0   b      1
4        7.0   b      4

In [37]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]], 
                     index=['a', 'c', 'e'], columns=['Seoul', 'Incheon'])
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                      index=['b', 'c', 'd', 'e'], columns=['Daegu', 'Ulsan'])
left2
pd.merge(left2, right2, how="outer", left_index=True, right_index=True)

   Seoul  Incheon  Daegu  Ulsan
a    1.0      2.0    NaN    NaN
b    NaN      NaN    7.0    8.0
c    3.0      4.0    9.0   10.0
d    NaN      NaN   11.0   12.0
e    5.0      6.0   13.0   14.0

In [32]:
s1 = pd.Series([0, 1], index=["a", "b"])
s2 = pd.Series([2, 3, 4], index=["c", "d", "e"])
s3 = pd.Series([5, 6], index=["f", "g"])

In [33]:
s1

a    0
b    1
dtype: int64

In [34]:
s2

c    2
d    3
e    4
dtype: int64

In [35]:
s3

f    5
g    6
dtype: int64

In [39]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [40]:
pd.concat([s1,s2,s3],axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [42]:
s4=pd.concat([s1*5,s3])

In [43]:
s4

a    0
b    5
f    5
g    6
dtype: int64

In [45]:
pd.concat([s1,s4],axis=1)

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [46]:
s1

a    0
b    1
dtype: int64

In [47]:
pd.concat([s1, s2, s3], axis=1, keys=["one", "two", "three"])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [50]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), 
                   index=['a', 'b', 'c'], columns=['one', 'two'])
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), 
                   index=['a', 'c'], columns=['three', 'four'])

In [51]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [52]:
df2

   three  four
a      5     6
c      7     8

In [53]:
pd.concat([df1,df2],axis=1)

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0

In [54]:
df3 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df4 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [55]:
df3

          a         b         c         d
0  1.279473  1.362711  2.242518  0.555030
1  0.084557  0.806445  0.261892 -0.281736
2 -0.399238 -0.329647 -0.201309  0.577394

In [56]:
df4

          b         d         a
0  1.588581 -0.092614 -0.791219
1  1.068115 -0.220239 -1.574209

In [57]:
pd.concat([df3,df4])

          a         b         c         d
0  1.279473  1.362711  2.242518  0.555030
1  0.084557  0.806445  0.261892 -0.281736
2 -0.399238 -0.329647 -0.201309  0.577394
0 -0.791219  1.588581       NaN -0.092614
1 -1.574209  1.068115       NaN -0.220239

In [58]:
pd.concat([df3,df4],ignore_index=True)

          a         b         c         d
0  1.279473  1.362711  2.242518  0.555030
1  0.084557  0.806445  0.261892 -0.281736
2 -0.399238 -0.329647 -0.201309  0.577394
3 -0.791219  1.588581       NaN -0.092614
4 -1.574209  1.068115       NaN -0.220239